{"data":{"site":{"siteMetadata":{"title":"Russell J. Anderson, Web Developer","author":"Russell J. Anderson"}},"markdownRemark":{"id":"aa107f05-8fae-57e6-8c0b-3de21f1ffa57","html":"<p>In late 2016 and early 2017 I was fortunate enough to give my first conference talks, and I want to keep some info about them here for posterity.</p>\n<p>In October 2016 I spoke at <a href=\"http://www.lrtechfest.com\">Little Rock Tech Fest</a>, an extremely fun community-led conference in Arkansas. I decided to talk about the pitfalls of refactoring code, particularly if you are not disciplined in doing so. I called it ‘“This Code Sucks” and other tales of developer hubris’. Later in February 2017 I gave this talk again at <a href=\"https://www.pytennessee.org/\">PyTennessee</a> in Nashville, with a few of my code examples ported over to Python rather than JavaScript. <a href=\"http://russelljanderson.com/refactor-slides/#/\">Slides from that talk can be found here</a>. It’s a fun talk that I would like to expand and give again, and applies across programming languages to web development in general.</p>\n<p><img src=\"https://img.youtube.com/vi/cMxI8n393ZM/0.jpg\" alt=\"Poster from my YouTube recorded talk\"></p>\n<p>In November of 2017 I spoke at <a href=\"http://nodevember.org/\">Nodevember</a>, an excellent JavaScript conference in my hometown of Nashville. This talk, “Fizz buzzkill - Answering tricky JS interview questions” used a list of made up js interview questions I found as an excuse to talk about some basic JS concepts that can be hard to explain or remember. In fact I should go back and review this talk myself and re-remember some of what I used to know. I had a great time giving this beginner level talk and then discussing the farse that are technical interviews. You can <a href=\"https://www.youtube.com/watch?v=cMxI8n393ZM&#x26;t=5s\">watch it here</a> or <a href=\"http://russelljanderson.com/nashjsslides\">see the slides here</a>.</p>","frontmatter":{"title":"Conference Talks","date":"December 27, 2017","path":"/conference-talks/"},"excerpt":"In late 2016 and early 2017 I was fortunate enough to give my first conference talks, and I want to keep some info about them here for…"},"unsplashPhoto":{"id":"3aVlWP-7bg8","description":"high-angle photography of group of people sitting at chairs","urls":{"full":"https://images.unsplash.com/photo-1492538368677-f6e0afe31dcc?ixlib=rb-1.2.1&q=85&fm=jpg&crop=entropy&cs=srgb&ixid=eyJhcHBfaWQiOjE5Mzk0fQ","regular":"https://images.unsplash.com/photo-1492538368677-f6e0afe31dcc?ixlib=rb-1.2.1&q=80&fm=jpg&crop=entropy&cs=tinysrgb&w=1080&fit=max&ixid=eyJhcHBfaWQiOjE5Mzk0fQ","small":"https://images.unsplash.com/photo-1492538368677-f6e0afe31dcc?ixlib=rb-1.2.1&q=80&fm=jpg&crop=entropy&cs=tinysrgb&w=400&fit=max&ixid=eyJhcHBfaWQiOjE5Mzk0fQ"},"user":{"name":"Mikael Kristenson","links":{"html":"https://unsplash.com/@mikael_k"}}}},"pageContext":{"slug":"/conference-talks/","unsplash":"3aVlWP-7bg8"}}