{"data":{"site":{"siteMetadata":{"title":"Russell J. Anderson, Web Developer","author":"Russell J. Anderson"}},"markdownRemark":{"id":"7edd6e25-153f-5975-9779-7318aa8af1e3","html":"<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">Your UI development process is too slow and cumbersome, so you invest in prototyping tools that don&#39;t use your code. Now you have two problems.</p>&mdash; Mark Dalgleish (@markdalgleish) <a href=\"https://twitter.com/markdalgleish/status/973663937571909632?ref_src=twsrc%5Etfw\">March 13, 2018</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>I saw this tweet the other day. It has inspired me to extrapolate on a product development process I currently use. I first mentioned this process in my <a href=\"http://russelljanderson.com/ambiguous-requirements/\">last post</a>.</p>\n<p>I mean this post to be descriptive of the process, not necessarily prescriptive for anybody else. Take from it what you will. It hasn’t always worked perfectly. Yet, I feel like it has allowed our small teams to rapidly build a volume of quality software. Incidentally, it has also helped preserve my sanity.</p>\n<h2 id=\"product-development-can-be-the-bottleneck\"><a href=\"#product-development-can-be-the-bottleneck\" aria-label=\"product development can be the bottleneck permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Product development can be the bottleneck</h2>\n<p>Let’s take for granted that everybody is going to want to push features faster. Often, when we reflect on the time it takes to deliver a feature, the burden gets placed on developers to increase efficiencies or to skip things like unit tests. A lot of post-mortem decision making includes ways to reduce the development time constraint.</p>\n<p>I wonder, though, if the same consideration should be given to the time spent planning/deliberating over requirements and specific implementation of those requirements represented by wireframes or even more fully realized graphic designs? What if we could net time by shifting the design process closer to the finished product?</p>\n<h2 id=\"working-without-a-graphic-designer\"><a href=\"#working-without-a-graphic-designer\" aria-label=\"working without a graphic designer permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Working without a graphic designer</h2>\n<p>At my last two companies our small teams have been without a dedicated graphic designer. No one was responsible for creating designs, wireframes, mockups, etc for developers to work from when implementing a new feature. I familiarized myself with tools like Sketch and Omnigraffle to produce wireframes. Early on, our product/business teams relied on these to flesh out requirements and determine how a new feature would meet them.</p>\n<p>I quickly identified some issues:</p>\n<ol>\n<li>As a developer, fumbling through a tool like Sketch was only marginally easier than developing it in HTML/CSS/JS</li>\n<li>These wireframes prompted lengthy discussions, which were difficult to control and would frequently drift off into tangents unrelated to the specific feature</li>\n<li>We would iterate on the wireframes, come back and deliberate even more. They fell victim to perfectionism, which makes sense if they are meant to serve as gospel truth to a developer about to build out a feature</li>\n<li>Expectations were set as a result of these deliberations. Unseen constraints encountered in actual development would often lead to further deliberation and often disappointment</li>\n</ol>\n<p>I am not a graphic designer foremost. However, over the years of developing websites (from other’s designs) and applications, and from following smart people on twitter and caring about best practices, I do believe I’ve picked up enough knowledge to consider myself a UX designer. As a developer (mostly front-end) I care about my code and how I write it, but ultimately, what I care about is the end product, and if it’s user friendly and valuable. I often gladly had a say in the ultimate UI/UX of the product I was building. That is definitely part of the job.</p>\n<p>So, at my last two companies, I pushed to have us <em>skip wireframing and graphic designing altogether</em> in favor of iterative initial development. Based on a set of requirements, I would usually just get to work, building and designing at the same time. We would then review my implementation, deliberate, tweak, sometimes multiple times, but then ultimately arrive on the desired feature.</p>\n<h2 id=\"laying-the-foundation\"><a href=\"#laying-the-foundation\" aria-label=\"laying the foundation permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Laying the foundation</h2>\n<p>I should mention that we had a great foundation to work from. We took great efforts before we built our product to put together a style guide and an atomic design system that dictated a number of things for our applications. Most of the major UI/UX components should be there, and in many cases it was just a matter of piecing them together.</p>\n<p>If at any point I felt like I was venturing into uncharted territory, this was likely a sign that I should bring in other opinions and expand our existing framework of design components. We were forever aiming for consistency and reusability with our UI/UX because that not only leads to more expeditious development but also to a better user experience all around.</p>\n<p>Additionally, I had to make sure that other stakeholders (product owners, designers) could easily view my working prototype before merging it into the codebase (Heroku’s pull request app generation was useful for this). I had to treat it as a work in progress, and expect changes and feedback. A lot of the challenge was managing my own expectations.</p>\n<h2 id=\"the-benefit\"><a href=\"#the-benefit\" aria-label=\"the benefit permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>The benefit</h2>\n<p>Here’s what we gained.</p>\n<h3 id=\"really-understanding-the-constraints\"><a href=\"#really-understanding-the-constraints\" aria-label=\"really understanding the constraints permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Really understanding the constraints</h3>\n<p>Maybe I’m all alone in this, but when I sit down in a design discussion with nothing but tickets and graphics, I am rarely able to think about the nitty gritty details of my software in any meaningful way. It never fails, but as soon as I actually start trying to implement a design, a flood of reality hits me about the shape of data in our database, other code that should be reused, and what might take 10 days rather than 10 minutes. At this point, if I am working from a design, the conversation to make changes might be really difficult.</p>\n<p>Often when you are working from a design, so many alternatives have been considered, so many expectations have been set, that the developer becomes the bad guy when he or she pushes back. Everyone leaves dissatisfied.</p>\n<p>No matter how good the design or how long the planning process, stuff will always be missed until one actually begins to code.</p>\n<p>By attempting to prototype without a fully fleshed design, the developer is able to specifically communicate these constraints. Alternatives and iterative ideas can flow without anyone’s expectations being let down. Peace in the valley (not really but kinda).</p>\n<h3 id=\"cutting-out-the-middleman\"><a href=\"#cutting-out-the-middleman\" aria-label=\"cutting out the middleman permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Cutting out the middleman</h3>\n<p>Often, the requirements for a feature will be fleshed out by one party, who hopefully understands the needs of the user. Then, another party will create the graphic design. Then, a third party will implement the feature in code. This can mean the developer is out of touch with the underlying needs of the user, and this can have a negative impact on your product. It can be more about implementing the design than it is about satisfying the needs of the user.</p>\n<p>In my experience, getting the developer closer to the actual needs of the user results in better software. And it’s more motivating for the developer! Understanding how my work (which can be drudgery) will actually solve problems creates a lot of satisfaction. There’s real ownership there.</p>\n<h3 id=\"speeeeeeeeeeeed\"><a href=\"#speeeeeeeeeeeed\" aria-label=\"speeeeeeeeeeeed permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Speeeeeeeeeeeed</h3>\n<p>Let’s just be honest with ourselves. Even if you implement a design perfectly down to each particular pixel, there will still be changes. Certain “feel” just can’t be measured in a Sketch file, without complete interactivity. And as the tweet above mentions, you could either invest in prototyping tools that are still not actual code, or you could just <em>code</em>. I can’t say exactly how much of this product development philosophy is inspired by my hatred of meetings, but it certainly has helped eliminate many of them.</p>\n<p>Often, the design review and deliberation would result in very small iterations, which could be done quickly, sometimes during the design review meeting itself. We seemed to get so much closer to finished product so much faster by writing it in code from the get-go. An added bonus is that we’d also identify bugs at the same time. The design review had crossover benefit of QA.</p>\n<h2 id=\"conclusions\"><a href=\"#conclusions\" aria-label=\"conclusions permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Conclusions</h2>\n<p>It wasn’t always perfect. And for some features that were complete green field, we did follow a more traditional product planning approach. For the most part, however, this approach allowed us to generate production ready features quickly. I got much better at UI/UX design, and we saved a great deal of man hours that would have been languished in meetings.</p>","frontmatter":{"title":"Redesign Your Workflow","date":"March 24, 2018","path":"/redesign-your-workflow/"},"excerpt":"I saw this tweet the other day. It has inspired me to extrapolate on a product development process I currently use. I first mentioned this…"},"unsplashPhoto":{"id":"KR84RpMCb0w","description":"Art supplies clutter","urls":{"full":"https://images.unsplash.com/photo-1459908676235-d5f02a50184b?crop=entropy&cs=srgb&fm=jpg&ixid=MnwxOTM5NHwwfDF8Y29sbGVjdGlvbnw3fDE1Nzg1MDh8fHx8fDJ8fDE2MTg4ODIxMjE&ixlib=rb-1.2.1&q=85","regular":"https://images.unsplash.com/photo-1459908676235-d5f02a50184b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxOTM5NHwwfDF8Y29sbGVjdGlvbnw3fDE1Nzg1MDh8fHx8fDJ8fDE2MTg4ODIxMjE&ixlib=rb-1.2.1&q=80&w=1080","small":"https://images.unsplash.com/photo-1459908676235-d5f02a50184b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxOTM5NHwwfDF8Y29sbGVjdGlvbnw3fDE1Nzg1MDh8fHx8fDJ8fDE2MTg4ODIxMjE&ixlib=rb-1.2.1&q=80&w=400"},"user":{"name":"Khara Woods","links":{"html":"https://unsplash.com/@kharaoke"}}}},"pageContext":{"slug":"/redesign-your-workflow/","unsplash":"KR84RpMCb0w"}}